<img src="../assets/logo3.png" width="200" height="200" >

<div style="display:block"><br><br>
    <div style="display:block" align=left display=block> 
        <font size=5><b>HandsOn 4 - Solution - Pandas in Action</b></font><br>
        <hr/>

</div>

<pre>
.
â”œâ”€â”€ Importing Modules/Libraries
â”‚
â”œâ”€â”€ Load data from local disk
â”‚
â”œâ”€â”€ Quick look at data
â”‚ 
â”œâ”€â”€ Data Statistics
â”‚
â”œâ”€â”€ Selecting Rows/Columns from dataframe
â”‚
â”œâ”€â”€ Data Cleaning
â”‚
â””â”€â”€ Final Processing and Saving Dataframes
</pre>

Pandas is a library for data analysis built on top of the Python programming language. A library (also called a package) is a collection of code for solving problems in a specific field of endeavor. Pandas is a toolbox for data manipulation operations: sorting, filtering, cleaning, deduping, aggregating, pivoting, and more. The epicenter of Pythonâ€™s vast data science ecosystem, pandas pairs well with other libraries for statistics, natural language processing, machine learning, data visualization, and more.

The sections marked with a Thinking Emoji (ðŸ’­) are those which you need to read and answer. All right, without further ado, let's get started!

## Import Modules/Libraries

In [1]:
import pandas as pd
import numpy as np

---------------------------------

## Load and Inspect Data

### ðŸ“– Load data from local disk

First, we need to load the data from the local disk as a Pandas dataframe.
- income csv, which is the dataset for people's income in `adults_income.csv`

ðŸ’­ **Write the answer below:**  
(Hint: You can use `read_csv` method from Pandas library and save the dataframe in `df` variable)

In [2]:
df = pd.read_csv("/content/adults_income.csv")

-----------------------------------------

### ðŸ“– Quick look at data

Now, we need to display multiple rows of our dataframe. Pandas have several methods for this task. 

#### ðŸ’­ Questions
- Display first 5 rows of dataframe.
- Display last 15 rows of dataframe.
- Display randomly 5 rows of dataframe.

**Write the answer below:**

In [ ]:
# first 5 rows
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,0,Private,226802,11th,7.0,!,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9.0,!,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12.0,!,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,0,Private,160323,Some-college,10.0,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10.0,!,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [ ]:
# last 15 rows
df.tail(15)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48827,37,Private,198216,Assoc-acdm,12.0,!,Tech-support,Not-in-family,White,Female,0,0,40,United-States,<=50K
48828,43,Private,260761,HS-grad,9.0,!,Machine-op-inspct,Husband,White,Male,0,0,40,Mexico,<=50K
48829,65,Self-emp-not-inc,99359,Prof-school,15.0,Never-married,Prof-specialty,Not-in-family,White,Male,1086,0,60,United-States,<=50K
48830,43,State-gov,255835,Some-college,10.0,Divorced,Adm-clerical,Other-relative,White,Female,0,0,40,United-States,<=50K
48831,43,Self-emp-not-inc,27242,Some-college,NaN,!,Craft-repair,Husband,White,Male,0,0,50,United-States,<=50K
48832,32,Private,34066,10th,6.0,!,Handlers-cleaners,Husband,Amer-Indian-Eskimo,Male,0,0,40,United-States,<=50K
48833,43,Private,84661,Assoc-voc,11.0,!,Sales,Husband,White,Male,0,0,45,United-States,<=50K
48834,32,Private,116138,Masters,NaN,!,Tech-support,Not-in-family,Asian-Pac-Islander,Male,0,0,11,Taiwan,<=50K
48835,53,Private,321865,Masters,14.0,!,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K
48836,0,Private,310152,Some-college,10.0,!,Protective-serv,Not-in-family,White,Male,0,0,40,United-States,<=50K
48837,27,Private,257302,Assoc-acdm,12.0,!,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9.0,!,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,0,Private,151910,HS-grad,9.0,!,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9.0,!,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [ ]:
# random 5 rows
df.sample(5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
23153,52,Private,204322,Assoc-voc,11.0,!,Tech-support,Husband,White,Male,5013,0,40,United-States,<=50K
30257,38,Private,129102,HS-grad,9.0,!,Exec-managerial,Husband,White,Male,0,0,50,United-States,<=50K
33838,58,Local-gov,489085,Bachelors,NaN,Married-civ-spouse,Prof-specialty,Husband,Black,Male,0,0,40,United-States,<=50K
8885,55,Private,142020,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,<=50K
7348,67,Private,283416,Masters,14.0,!,Prof-specialty,Not-in-family,White,Male,0,0,40,United-States,<=50K

---------------------------------------------------

### ðŸ“– Data Statistics

In this cell we want to see some statistics of our dataframe.

#### ðŸ’­ Questions
- print `descriptive statistics` of dataframe. What information does this method provide for each column?
- print `shape` of dataframe.
- print columns' `data types`.
- print a `summary` information of dataframe.

**Write the answer below:**

In [ ]:
# descriptive statistics
df.describe()
# it provides statistical information like min, max, Avarage adn ... for each column

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,43958.000000,48842.000000,48842.000000,48842.000000
mean,34.756910,1.896641e+05,10.081464,1079.067626,87.502314,40.422382
std,17.410589,1.056040e+05,2.568369,7452.019058,403.004552,12.391444
min,0.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,24.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,35.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,46.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [ ]:
# shape of dataframe
df.shape

(48842, 15)

In [ ]:
# columns data types
df.dtypes

age                  int64
workclass           object
fnlwgt               int64
education           object
educational-num    float64
marital-status      object
occupation          object
relationship        object
race                object
gender              object
capital-gain         int64
capital-loss         int64
hours-per-week       int64
native-country      object
income              object
dtype: object

In [ ]:
# summary of information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  43958 non-null  float64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: float64(1), int64(5), object(9)
memory usage: 5.6+ MB

---------------------------------------------

### ðŸ“– Selecting Rows/Columns from dataframe.
here we want to see how we can select rows and columns of a dataframe.
for selecting columns of a dataframe we can use different ways like:
- using `loc` or `iloc` methods of Pandas.
- just putting the string name of the column in brackets.  
  

for select rows of a dataframe, again we have several ways:
- using `loc` or `iloc` methods.
- select the same as list indexing.

#### ðŸ’­ Questions:
- Select and print rows 256 to 512 of `age` with `iloc` and `loc` method. calculate `mean`, `max`, and `min` age for these rows.
- Select and print rows 256 to 512 of `age` with giving column names in bracket and indexing. calculate `mean`, `max`, and `min` age for these rows.
- Is there any difference between the results of different selection methods

**Write the answer below:**

In [3]:
# iloc
df.iloc[256:513, 0]

256    62
257    39
258    30
259    72
260    50
       ..
508     0
509    35
510    27
511    66
512    21
Name: age, Length: 257, dtype: int64

In [4]:
# calculate mean, max, min
df.iloc[256:513, 0].mean()

33.09727626459144

In [5]:
df.iloc[256:513, 0].max()

73

In [6]:
df.iloc[256:513, 0].min()

0

In [7]:
# loc
df.loc[256:512, ["age"]]

     age
256   62
257   39
258   30
259   72
260   50
..   ...
508    0
509   35
510   27
511   66
512   21

[257 rows x 1 columns]

In [10]:
# brackets and indexing
df['age'][256:513]

256    62
257    39
258    30
259    72
260    50
       ..
508     0
509    35
510    27
511    66
512    21
Name: age, Length: 257, dtype: int64

In [11]:
# calculate mean, max, min
df['age'][256:513].mean()

33.09727626459144

In [12]:
df['age'][256:513].max()

73

In [13]:
df['age'][256:513].min()

0

--------------------------------------

### ðŸ“– Data Cleaning

Text data can get quite messy. Real-world data sets are riddled with incorrect characters, improper letter casings, whitespace, and more. The process of cleaning data is called wrangling or munging. Often, the majority of our data analysis is dedicated to munging. We may know the insight we want to derive early on, but the difficulty lies in arranging the data in a suitable shape for the manipulation. Luckily for us, one of the primary motivations behind pandas was easing the difficulty of cleaning up improperly formatted text values.

#### ðŸ’­ Questions:
- check duplicated values. if there exist, remove them and keep the first one.
- check dataframe for unrelated values. if there exist, replace unrelated values in dataframe with `np.nan`
- find the number of nan values for each column
- handle missing/nan values with different methods (`dropping column`, `impute with proper value`)

**Write the answer below:**

In [14]:
# check for duplicates
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
48837    False
48838    False
48839    False
48840    False
48841    False
Length: 48842, dtype: bool

In [15]:
df.duplicated().value_counts()

False    48814
True        28
dtype: int64

In [16]:
# remove duplicates
df = df.drop_duplicates(keep='first')

In [17]:
# replace unrelated values
df.age = df.age.replace({0:np.nan,})
df = df.replace({'!':np.nan, '?':np.nan})

In [18]:
# find numbers of missing values for each column
df.isna().sum()

age                 4884
workclass           2794
fnlwgt                 0
education              0
educational-num     4884
marital-status     36607
occupation          2804
relationship           0
race                   0
gender                 0
capital-gain           0
capital-loss           0
hours-per-week         0
native-country       857
income                 0
dtype: int64

In [19]:
# handle missing values
# drop 'marital-status, capital-gain and capital-loss columns. because they have more than 70 percent nan values
df = df.drop(['marital-status' , 'capital-gain', 'capital-loss'], axis=1)
# filling age column with median age
df.age = df.age.fillna(df.age.median())
# filling missing string values with 'missing' 
df[['workclass','occupation','native-country']] = df[['workclass','occupation','native-country']].fillna('missing')
# recreate the eduactional-num column by encoding education column
df['educational-num'] = df['education'].astype('category').cat.codes

In [20]:
df.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
occupation         0
relationship       0
race               0
gender             0
hours-per-week     0
native-country     0
income             0
dtype: int64

--------------------------------

### ðŸ“– Final Processing and Saving Dataframes
After cleaning data, in this section, you are going to do som final processes and save the processed dataframe as a `csv` file.

#### ðŸ’­ Questions:
- calculate the 1st and 3rd `quantile` of the `age` column and their distance from `median (second quantile)`. which of the quantiles (1st or 3rd) is closer to the median?
- Add a new column to dataframe with the name `age_category`. If the age of a person is less than 20 assign the value of this column to 1. if the age is between 20 and 30, age_category's value must be 2. assign 3 to age_category if the age is between 30 and 40. and assign 4 if the age is more than 40.
- count number of values in each category for the `age_category` feature.
- (Bonus) create a new column with the name `hours_in_year`. calculate the hours that each person works during the year.
- (Bonus) In this Question, you are going to use values of multiple columns. create a `avrege_hour_income` column. If a person's income is more than 50K, divide 120 by the number of hours he\she works during the year. If a person has an income less than 50, divide 50 by the number of hours he\she works during the year.
- (Bonus) print the maximum income per average which you calculated in the last question.
- Save the dataframe as a `csv` file with proper `encoding` and dropping the `index` with the name of `clean_adults_income.csv`

**Write the answer below:**   
(Hint: work with `lambda` functions and usefull methods of `pandas`)

In [ ]:
# Calculate Quatiles
df.age.quantile(0.25)

29.0

In [ ]:
df.age.quantile(0.75)

46.0

In [ ]:
# add age_category column
def categorize_age(age):
    cat = 1
    if age >20 and age <=30:
        cat = 2
    elif age > 30 and age<=40:
        cat = 3
    else: 
        cat = 4
    return cat

df['age_category'] = df.age.apply(lambda x : categorize_age(x))

In [ ]:
# count number of values
df.age_category.value_counts()

4    21419
3    16445
2    10950
Name: age_category, dtype: int64

In [ ]:
# (Bonus) create new column hours_in_year
# we have 53 week in a year
df['hours_in_year'] =  df['hours-per-week'] * 53

In [ ]:
# (Bonus) create avrege_hour_income column
def average_income(income, hour_in_year):
    average = 0
    if income == '<=50K':
        average = 50 / hour_in_year
    else:
        average = 120 / hour_in_year
    return average

df['avarage_hour_income'] = df.apply(lambda x : average_income(x.income, x.hours_in_year) ,axis=1)

In [ ]:
# (Bonus) max and min avrege_hour_income
df['avarage_hour_income'].max()

2.2641509433962264

In [ ]:
df['avarage_hour_income'].min()

0.00952925481227368

In [ ]:
# save csv
df.to_csv('clean_adults_income.csv', encoding='utf-8', index=False)

# Good Luck ðŸ˜‰

# Reference:
- Pandas in Action, Boris Paskhaver, Manning Publication.